{
  "backend/main.mo": "Motoko actor defining a towing request management system with types for TowingRequest, functions to submit requests (with validation), retrieve all requests sorted by ID, and get individual requests by ID.",
  "feature_evidence.json": "Feature evidence report documenting implemented ETRMembership component features including pricing display, 24/7 service cards, mobile battery service, and flat tire service with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing the towing service website structure including Header, Hero, About, Services, ETRMembership, ServiceArea, ContactForm, Footer, hooks, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space, including primary, secondary, muted, accent, destructive, border, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point with page title 'Ethos Towing & Recovery INC', favicon reference to mii.png, and root div mounting point for the React application.",
  "frontend/src/App.tsx": "Main React application component orchestrating the page layout with Header, Hero, About, Services, ETRMembership, ServiceArea, ContactForm, Footer, Chatbot with toggle, and Toaster for notifications using the useChatbot hook.",
  "frontend/src/components/About.tsx": "About section component displaying four feature cards (Experienced Team, 24/7 Availability, Licensed & Insured, Professional Service) with icons, hover effects, and gradient backgrounds emphasizing trust and expertise.",
  "frontend/src/components/Chatbot.tsx": "Chatbot component rendering a fixed-position chat interface with message history, input field, send/clear/close controls, suggestion buttons, and auto-scroll functionality that can navigate to the contact form on specific suggestions.",
  "frontend/src/components/ChatbotToggle.tsx": "Floating action button component that toggles the chatbot visibility, displaying either a MessageCircle or X icon with 'Winchy' label and shadow effects.",
  "frontend/src/components/ContactForm.tsx": "React form component for submitting towing service requests with validation, using React Query for mutations and displaying success/error toasts. Collects customer details (name, phone, location, vehicle type, service details) and submits to backend actor.",
  "frontend/src/components/ETRMembership.tsx": "Displays the ETR Everyday membership program with $110/year pricing and a grid of seven service features including 24/7 roadside assistance, battery service, flat tire service, fuel delivery, lockout services, member discounts, and automotive advice.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information, contact details (phone, email, address), social media links (Facebook, X, Instagram), and business hours with decorative styling and responsive grid layout.",
  "frontend/src/components/Header.tsx": "Sticky header component with company logo, brand name, and call-to-action buttons for phone contact (559-944-8178) and email, with responsive design for mobile and desktop views.",
  "frontend/src/components/Hero.tsx": "Hero section with background image overlay, headline \"Professional Towing When You Need It\", trust badges (24/7 service, licensed & insured), and CTA buttons for requesting service or calling directly.",
  "frontend/src/components/ServiceArea.tsx": "Section displaying service coverage information with two cards: primary service area (Fresno and Central Valley) and extended coverage (statewide California long-haul towing), featuring icons and gradient styling.",
  "frontend/src/components/Services.tsx": "React component that displays a grid of six towing service offerings (emergency, long-distance, roadside assistance, recovery, flatbed, motorcycle) with icons, descriptions, and hover effects.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useChatbot.ts": "Custom React hook that manages chatbot state including messages, open/close status, and provides functions to send messages, clear history, and toggle visibility with initial greeting and suggestions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React hooks wrapping React Query for fetching all towing requests and submitting new requests via the backend actor, with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, custom CSS variables for light/dark theme colors using OKLCH color space, typography settings with Inter and Space Grotesk fonts, and accessibility styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/chatbotResponses.ts": "Utility module containing predefined chatbot responses for various topics (services, membership, emergency, roadside assistance, etc.) with follow-up suggestions, and a function to match user input to appropriate responses.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, container settings, border radius variables, custom box shadows, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting a professional towing company website (Ethos Towing & Recovery INC) with features including hero section, service area display, contact forms, chatbot integration, and an ETR Everyday subscription membership program at $110."
}