{
  "backend/main.mo": "Motoko actor defining TowingRequest type with fields for customer info, location, vehicle details, and optional drop location; provides functions to submit requests, retrieve all requests sorted by ID, and get individual requests by ID.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: chatbot display fix, email address addition to header, and long-haul distance update from '400 miles' to 'entire California state' across multiple components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App.tsx, Header.tsx, Hero.tsx, About.tsx, Services.tsx, ServiceArea.tsx, ContactForm.tsx, Footer.tsx, hooks, styles, and configuration files.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space, including variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, favicon link to mii.png logo, page title 'Ethos Towing Services INC Website', and script tag loading main.tsx module.",
  "frontend/src/App.tsx": "Main React application component rendering Header, Hero, About, Services, ServiceArea, ContactForm, Footer, Toaster, ChatbotToggle, and Chatbot components with chatbot state management via useChatbot hook.",
  "frontend/src/components/About.tsx": "About section component displaying four feature cards (Experienced Team, 24/7 Availability, Licensed & Insured, Professional Service) with icons, titles, descriptions, hover effects, and gradient backgrounds in a responsive grid layout.",
  "frontend/src/components/Chatbot.tsx": "Chatbot component with sliding panel UI featuring message display with native scroll, user/bot message distinction, suggestion buttons, input field with send button, clear history and close controls, and auto-scroll to latest messages.",
  "frontend/src/components/ChatbotToggle.tsx": "Floating action button component positioned at bottom-right that toggles chatbot visibility, displaying MessageCircle icon when closed and X icon when open with shadow and transition effects.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation that submits service requests to the backend actor, including fields for name, phone, location, vehicle type, and service details. Uses React Query for mutations and displays toast notifications on success/error.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information, contact details (phone, email, address), business hours, social media links, and copyright notice. Includes decorative elements and responsive grid layout.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, brand name, contact information, and call-to-action buttons. Features responsive design with different layouts for mobile and desktop views.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline, trust badges (24/7 service, licensed & insured), and primary CTAs for requesting service or calling. Includes decorative gradient overlays and geometric accent elements.",
  "frontend/src/components/ServiceArea.tsx": "Service area section displaying primary coverage (Fresno and Central Valley) and extended coverage (California statewide) with map icons and descriptive cards. Includes decorative background patterns and hover effects.",
  "frontend/src/components/Services.tsx": "Services showcase section displaying six towing service types (emergency, long-distance, roadside assistance, recovery, flatbed, motorcycle) in a responsive grid with icons, descriptions, and hover animations.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useChatbot.ts": "React hook managing chatbot state including messages, open/close state, and message sending with auto-generated bot responses and suggestions.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching all towing requests and submitting new requests via the backend actor, with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for light/dark theme colors using OKLCH color space, and typography configuration using Inter and Space Grotesk fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/chatbotResponses.ts": "Chatbot response logic with predefined responses for various topics (services, emergency, contact, etc.) and keyword matching to generate appropriate replies with suggestions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH, container settings, border radius variables, shadows, animations, and typography plugins.",
  "project_state.json": "Project state file tracking version 37 of a professional towing company website for Ethos Towing Services INC in Fresno, CA. Contains architectural notes, existing features list including hero section, services overview, contact form, and backend integration for form submissions with admin panel access."
}