{
  "backend/main.mo": "Motoko actor defining TowingRequest type and CRUD operations (submitRequest, getAllRequests, getRequest) with validation, sorting by ID/name, and auto-incrementing request IDs.",
  "feature_evidence.json": "Feature evidence report documenting removal of 'built with ♥ using caffeine.ai' text from Footer component with high confidence.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including App, Header, Hero, About, Services, ServiceArea, ContactForm, Footer components and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with page title 'Ethos Towing & Recovery INC', favicon reference to mii.png, and root div mounting React app from main.tsx.",
  "frontend/src/App.tsx": "Main React component orchestrating page layout with Header, Hero, About, Services, ServiceArea, ContactForm, Footer, Chatbot with toggle, and Toaster for notifications.",
  "frontend/src/components/About.tsx": "About section displaying four feature cards (Experienced Team, 24/7 Availability, Licensed & Insured, Professional Service) with icons, hover effects, and gradient backgrounds.",
  "frontend/src/components/Chatbot.tsx": "Chat interface component with message display, input field, send/clear/close controls, suggestion chips, auto-scroll, and special handling for 'fill out form' suggestions that scroll to contact form.",
  "frontend/src/components/ChatbotToggle.tsx": "Floating action button in bottom-right corner toggling chatbot visibility with MessageCircle/X icons and shadow effects.",
  "frontend/src/components/ContactForm.tsx": "Service request form with fields for name, phone, location, drop location, vehicle type, and service details, including validation, mutation handling, toast notifications, and emergency contact cards.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company info with logo, social media links (Facebook, X, Instagram), contact details (phone, email, address, hours), quick links, services list, and copyright information.",
  "frontend/src/components/Header.tsx": "Sticky header component with company logo, brand name, and contact actions including a prominent call button and email link, responsive for mobile and desktop layouts.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, trust badges (24/7 service, licensed & insured), large headline, and CTA buttons for requesting service or calling directly.",
  "frontend/src/components/ServiceArea.tsx": "Service area section displaying primary coverage (Fresno and Central Valley) and extended coverage (California statewide) with map visual and contact CTA.",
  "frontend/src/components/Services.tsx": "Services grid component showcasing six towing services (emergency, long-distance, roadside assistance, recovery/jump start, flatbed, motorcycle) with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "React hook managing Internet Identity authentication and actor creation, using React Query to cache and invalidate actor instances when identity changes.",
  "frontend/src/hooks/useChatbot.ts": "Custom hook managing chatbot state including messages, open/close toggle, sending messages with auto-generated responses, and clearing chat history.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching all towing requests and submitting new requests via the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, custom CSS variables for light/dark themes using OKLCH color space, and typography setup using Inter and Space Grotesk fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/utils/chatbotResponses.ts": "Chatbot response configuration defining predefined text responses and suggestions for various towing service inquiries including emergency towing, roadside assistance, and service area information.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH, extended container settings, custom shadows, animations, and typography plugins for the towing company website.",
  "project_state.json": "Project metadata tracking the current state (version 45) of the Ethos Towing & Recovery website, including architectural notes, existing features, color scheme requirements, and chatbot integration plans."
}