{
  "backend/main.mo": "Motoko actor defining TowingRequest type with fields for customer info, location, vehicle details, and optional drop location; provides functions to submit requests, retrieve all requests sorted by ID, and get individual requests by ID.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: mobile header text resizing, Jump Start service consolidation into Vehicle Recovery, chatbot form button fix, and chatbot response updates to reflect service changes.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (Header, Hero, About, Services, ContactForm, Footer, Chatbot), configuration files, and utilities with details about styling, functionality, and recent updates.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space, including variables for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with page title 'Ethos Towing & Recovery INC', favicon reference to mii.png, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React application component orchestrating layout with Header, Hero, About, Services, ServiceArea, ContactForm, Footer, Toaster, and integrated Chatbot with ChatbotToggle using useChatbot hook for state management.",
  "frontend/src/components/About.tsx": "About section component displaying four feature cards (Experienced Team, 24/7 Availability, Licensed & Insured, Professional Service) with icons, gradient hover effects, and centered heading explaining company values.",
  "frontend/src/components/Chatbot.tsx": "Chatbot component with message display, input field, send/clear/close controls, suggestion buttons, and special handling for 'fill out form' suggestions that scroll to and focus the contact form section.",
  "frontend/src/components/ChatbotToggle.tsx": "Floating action button component in bottom-right corner that toggles chatbot visibility, displaying MessageCircle icon when closed and X icon when open.",
  "frontend/src/components/ContactForm.tsx": "React component providing a contact form for service requests with validation, mutation handling via React Query, and integration with the backend actor to submit customer information (name, phone, location, vehicle type, service details).",
  "frontend/src/components/Footer.tsx": "Footer component displaying company information, contact details (phone, email, address), business hours, quick links, social media icons, and copyright notice with decorative styling.",
  "frontend/src/components/Header.tsx": "Sticky header component with company logo, branding, and prominent call-to-action buttons for phone contact and email, with responsive design for mobile and desktop.",
  "frontend/src/components/Hero.tsx": "Hero section component featuring a background image, headline, trust badges (24/7 service, licensed & insured), and call-to-action buttons for requesting service or calling directly.",
  "frontend/src/components/ServiceArea.tsx": "Component displaying service coverage information with primary service area (Fresno and Central Valley) and extended coverage details, featuring decorative cards with icons and descriptions.",
  "frontend/src/components/Services.tsx": "Services showcase component displaying six towing service offerings (emergency towing, long-distance, roadside assistance, recovery, flatbed, motorcycle) in a responsive grid with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor with authentication, using React Query to cache the actor instance and invalidate dependent queries when identity changes.",
  "frontend/src/hooks/useChatbot.ts": "React hook managing chatbot state including messages, open/closed state, and functions to send messages, clear history, and toggle visibility with auto-generated bot responses.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching all towing requests and submitting new requests via the ICP backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for light/dark theme colors using OKLCH color space, typography setup with Inter and Space Grotesk fonts, and accessibility focus styles.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/src/utils/chatbotResponses.ts": "Chatbot response generator with predefined responses for towing service inquiries including services, pricing, service area, contact info, and keyword-based matching logic.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color system using OKLCH, extended container settings, custom shadows, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file tracking version 43 of a professional towing company website (Ethos Towing & Recovery INC) with features including hero section, service listings, contact forms, chatbot integration, and admin panel. Contains architectural notes emphasizing red/white/blue color scheme, professional/authoritative design, and lists 17 existing features with their requirement IDs and versions."
}